### Clean Rows from empty fielts and NaNs

In [12]:
import pandas as pd
import numpy as np

from clean_rows import clean_NaN

In [13]:
# Create a toy DataFrame

In [14]:
df = pd.DataFrame([
    [-0.532681, 'foo', 0],
    [np.nan, 'bar', 1],
    [-1.387326, 'foo', 2],
    [0.814772, 'baz', ' '],     
    [-0.222552, 'nan', 4],
    [-1.176781,  'qux', '  '],         
], columns='A B C'.split(), index=pd.date_range('2000-01-01','2000-01-06'))

In [15]:
df

                   A    B   C
2000-01-01 -0.532681  foo   0
2000-01-02       NaN  bar   1
2000-01-03 -1.387326  foo   2
2000-01-04  0.814772  baz
2000-01-05 -0.222552  nan   4
2000-01-06 -1.176781  qux

In [16]:
new_df = clean_NaN(df)

There are  3  rows that contain NaN values.
Removing these rows ...
Succesfully Deleted!

In [17]:
new_df

                   A    B    C
2000-01-01 -0.532681  foo  0.0
2000-01-03 -1.387326  foo  2.0
2000-01-05 -0.222552       4.0